Revit 2024 API
ExternalEvent Class
 A class that represent an external event.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ExternalEvent : IDisposable
Visual Basic
Public Class ExternalEvent _
	Implements IDisposable
Visual C++
public ref class ExternalEvent : IDisposable
Remarks
 An instance if this class will be returned to an external event's owner upon the event's creation. The event's owner will use this instance to signal that his application needs to be called by Revit. Revit will periodically check if any of the events have been signaled (raised), and will execute all events that were signaled (raised) by calling the Execute method on the events' respective handlers.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ExternalEvent
See Also
ExternalEvent Members
Autodesk.Revit.UI Namespace